package Day2;

public class IfStatements {
    public static void main (String[] args){
        int a = 5;
        int b = 10;
        
        if ( (a+b)%2 == 0 ){
            System.out.println("May ne a and b are even");
        }else{
            System.out.println("Some variable is odd");
        }
        /*
        Задача №2

Необходимо создать две целочисленные переменные (a, b),
присвоить произвольные значения переменным на ваш выбор
 и вывести следующие строки:
maybe a and b are even - если сумма переменных четная
some variable is odd - если сумма переменных нечетная


Задача №3

Необходимо создать целочисленную переменную, присвоить
произвольное значение переменной на ваш выбор и вывести
 следующие строки:
больше 10 - если переменная больше 10
меньше 100 - если переменная меньше 100
результат деления на 2 больше 20 - если это соответствует
 истине
значение переменной между 5 и 40 включительно - если это
 правда
значение переменной меньше 5 или больше 40 - если предыдущие
 условие ложное

         */
    }
}
